# NoElementsLeftInExistingAssembly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..NoElementsLeftInExistingAssembly Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
There are no elements left in the assembly. It will be disassembled.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoElementsLeftInExistingAssembly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoElementsLeftInExistingAssembly As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoElementsLeftInExistingAssembly {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace